/*1. С помощью цикла while вывести все простые числа в промежутке от 0 до 100.*/

/*var i = 2;

while (i < 100) {
    if (isPrime(i)) {
    console.log(i);}
    i++;
}

function isPrime(num) {
    var i = 2;
    while (i < num) {
        if (num % i === 0) {
            return false;
        }
        i++;
    }
    return true;
}*/


/*2. С этого урока начинаем работать с функционалом интернет-магазина.
Предположим, есть сущность корзины. Нужно реализовать функционал подсчета
стоимости корзины в зависимости от находящихся в ней товаров.*/


/*3. Товары в корзине хранятся в массиве. Задачи:
a. Организовать такой массив для хранения товаров в корзине;
b. Организовать функцию countBasketPrice, которая будет считать стоимость корзины.*/

var basket = [
    ["капуста", 100, 4],
    ["морковь", 200, 5],
];

function countBasketPrice(items) {
    var total = 0;
    for (var i = 0; i < items.length; i++) {
        total += items[i][1] * items[i][2]
    }
    return total;
}

console.log("Общая стоимость корзины" + countBasketPrice(basket));


/*4. * Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла.
Выглядеть это должно так:
    for(...){// здесь пусто}*/

/*for (var i = 0; i <= 9; console.log(i++)) {
}*/


/*5. * Нарисовать пирамиду с 20 рядами с помощью console.log, как показано на рисунке:
    x
    xx
    xxx
    xxxx
    xxxxx
*/

/*
var x = "x";
var b = 20;
var i = 1;

while (i <= b) {
    console.log(x);
    x += "x";
    i++;
}*/
